{
    "experience": [
        {
            "id": "exp1",
            "jobTitle": "QA Automation Engineer - Envestnet",
            "companyName": "Envestnet",
            "location": "Berwyn, PA",
            "dateRange": "December 2021 - Present",
            "responsibilities": [
                "* Worked as a QA Lead, overseeing testing activities and ensuring quality deliverables.",
                "* Conducted API Testing using Postman, ensuring the functionality and reliability of APIs.",
                "* Automated API-related test cases using Node.js and RestAssured library, enhancing testing efficiency and accuracy.",
                "* Automated UI-related test cases using a JavaScript-based framework, improving UI testing processes.",
                "* Developed a custom testing framework using Maven, Java, and JUnit to consume Kafka messages, enabling efficient testing of message processing."
            ]
        },
        {
            "id": "exp2",
            "jobTitle": "QA Automation Engineer - Michelin",
            "companyName": "Michelin",
            "location": "Greenville, SC",
            "dateRange": "October 2019 - December 2021",
            "responsibilities": [
                "* Designed, developed, and implemented a Page Object Model (POM) based automation-testing framework using JavaScript and Sahi.",
                "* Conducted Smoke Testing, Functional Testing, Regression Testing, Database Testing, and API Testing at different stages of the development and test cycles.",
                "* Performed both UI and Backend Testing to ensure end-to-end system functionality.",
                "* Utilized Amazon DynamoDB, Elastic Search, and MySQL in automation scripts for efficient data storage and retrieval.",
                "* Created a JUnit framework with Java for DynamoDB data and implemented data validation processes.",
                "* Developed a Maven-based framework using RestAssured library, Java, and JUnit to compare large XML files, ensuring data integrity and accuracy."
            ]
        },
        {
            "id": "exp3",
            "jobTitle": "SDET - Wells Fargo",
            "companyName": "Wells Fargo",
            "location": "Charlotte, NC",
            "dateRange": "June 2019 – October 2019",
            "responsibilities": [
                "* Design different Mortgage Loan Scenarios.",
                "* Design, develop and implement Page Object Model (POM) based automation-testing framework utilizing Java, Selenium WebDriver, TestNG, and Maven.",
                "* Setup the Automation Framework using Selenium WebDriver to run test cases in multiple browsers and platforms."
            ]
        },
        {
            "id": "exp4",
            "jobTitle": "SDET - Book-IT",
            "companyName": "Book-IT",
            "location": "McLean, VA",
            "dateRange": "September 2018 – May 2019",
            "responsibilities": [
                "* Design, develop and implement Page Object Model (POM) based automation-testing framework utilizing Java, Selenium WebDriver, JUnit, Cucumber (Gherkin Language) and Maven.",
                "* Setup the Automation Framework using Selenium WebDriver to run test cases in multiple browsers and platforms.",
                "* Used BDD with Cucumber, Java and created feature files with a scenario and scenario outline as well as writing step definitions for behavior."
            ]
        },
        {
            "id": "exp5",
            "jobTitle": "SDET - VyTrack",
            "companyName": "VyTrack",
            "location": "McLean, VA",
            "dateRange": "March 2018 – September 2018",
            "responsibilities": [
                "* Assembled and maintained a Maven project written in Java to develop automated tests using TestNG.",
                "* Used Selenium WebDriver, Java and Cucumber to design Automation test scenarios.",
                "* Designed and documented REST/HTTP including JSON data formats and API versioning strategy with Rest-Assured.",
                "* Developed and executed SQL queries to verify proper insertion, deletion, and updates."
            ]
        }
    ]
}